Repository: jakepage91/validation-valley
Catalog: xliff/*.xlf
Languages: es

# s13da415a1db93926
source: You've successfully requested and handled microphone permissions, allowing the Oracle to hear the intent behind the whispers.
es: Has solicitado y gestionado con éxito los permisos del micrófono, permitiendo al Oráculo escuchar la intención tras los susurros.

# se264c69bae447575
source: The Echo
es: El Eco

# sf42449f0434cf23c
source: Voice Harmonizer
es: Armonizador de Voz

# scfb36373595fd434
source: The Parrot
es: El Loro

# sc74eddbf4e22e827
source: Implement speech synthesis to make the game talk back.
es: Implementa la síntesis de voz para que el juego te responda.

# scd2ee66dbaa85031
source: Silent Echoes
es: Ecos Silenciosos

# sac883044fbcbd962
source: The Oracle processes truth but remains silent. Give the digital construct a voice to speak the truths it finds.
es: El Oráculo procesa la verdad pero permanece en silencio. Dale al constructo digital una voz para que pronuncie las verdades que encuentre.

# s1fec5de83c2bf3df
source: Digital Voice Acquired
es: Voz Digital Adquirida

# sf68e8ba7e00aa971
source: Using the Web Speech API, the Oracle now speaks back, guiding you through the silicon trails.
es: Usando la API de Voz Web, el Oráculo ahora responde, guiándote por los senderos de silicio.

# sacbdc1c221d8dd04
source: Silver Tongue
es: Lengua de Plata

# sa90d7d38523ec71a
source: The Babel Fish
es: El Pez de Babel

# s5752bc8cf55b3374
source: Use the AI Prompt API to translate user commands into game actions.
es: Usa la API de Prompt de IA para traducir los comandos del usuario en acciones del juego.

# s1984b8233539ca09
source: Lost in Translation
es: Perdido en la Traducción

# sc2533fb26a1033ed
source: The Oracle hears 'Let's bounce' but doesn't know you mean 'return to hub'. Use the Prompt API to bridge the gap.
es: El Oráculo oye 'Vámonos de aquí' pero no sabe que quieres decir 'volver al hub'. Usa la API de Prompt para salvar la distancia.

# s4c6119ebcb85736c
source: Intent Deciphered
es: Intención Descifrada

# sb20dc157bad23345
source: You've integrated Gemini Nano to parse natural language into actionable game commands.
es: Has integrado Gemini Nano para analizar el lenguaje natural en comandos de juego accionables.

# sa6399cd49e562e09
source: Intent Weaver
es: Tejedor de Intenciones

# s6134de360773c65c
source: The Context Key
es: La Clave de Contexto

# sbde52275e0285033
source: Inject game context into the AI prompt for smarter responses.
es: Inyecta contexto del juego en el prompt de la IA para obtener respuestas más inteligentes.

# sc134455799a1ac3e
source: Blind Oracle
es: Oráculo Ciego

# s0f342b79a19a54aa
source: The AI doesn't know where you are or what you're holding. Inject the GameContext so it can understand 'Open this'.
es: La IA no sabe dónde estás ni qué tienes en la mano. Inyecta el GameContext para que pueda entender 'Abre esto'.

# s3f828be778e4cbaf
source: Contextual Awareness
es: Conciencia Contextual

# sc7cd1a9235a39074
source: By providing environmental data to the Prompt API, the Oracle can now make informed decisions based on the game's state.
es: Al proporcionar datos del entorno a la API de Prompt, el Oráculo ahora puede tomar decisiones informadas basadas en el estado del juego.

# s5e3f94e1a99eb268
source: Oracle's Sight
es: Vista del Oráculo

# sfd7b9d73fa2f8469
source: The Hallucination
es: La Alucinación

# s99fb273abfe837b0
source: Handle AI errors and invalid JSON responses gracefully.
es: Gestiona con elegancia los errores de la IA y las respuestas JSON no válidas.

# sdcf156c5e4f3ba3a
source: The Shattered Logic
es: La Lógica Destrozada

# s6afbcd9d112c466f
source: The Oracle sometimes speaks in riddles that break the game's logic. Build a shield to catch invalid responses.
es: El Oráculo a veces habla en acertijos que rompen la lógica del juego. Construye un escudo para atrapar las respuestas no válidas.

# sa4e8f4447b78a1d2
source: Logic Refined
es: Lógica Refinada

# sd3783e08e004779c
source: You've implemented robust error handling and response validation for the AI's output.
es: Has implementado un manejo de errores robusto y validación de respuestas para la salida de la IA.

# s1eb6cffb76a1d8fe
source: Rigid 'if/else' command matching that fails on natural language. Lack of accessibility through voice.
es: Coincidencia rígida de comandos 'if/else' que falla con el lenguaje natural. Falta de accesibilidad mediante la voz.

# s462b7390b63855e9
source: Built-in AI
es: IA Integrada

# s688a22943ad69f1b
source: Prompt API
es: API de Prompt

# se6c9e53f486b4dcd
source: Web Speech API
es: API de Voz Web

# sab82ddda38cf7cf3
source: Intent Parsing
es: Análisis de Intenciones

# sa5a8434e463294d4
source: Ability to control the game via natural language and voice
es: Capacidad de controlar el juego mediante lenguaje natural y voz

# sc303d0347013a5b6
source: Command Override
es: Anulación de Comandos

# sc5bd76e2005e1d17
source: CONTROLS
es: CONTROLES

# sda6330d625b26211
source: ARROWS TO MOVE
es: FLECHAS PARA MOVER

# sd49b2aec17481470
source: SPACE TO INTERACT
es: ESPACIO PARA INTERACTUAR

# s23cd6a7952b76f82
source: ESC TO MENU
es: ESC PARA MENÚ

# sc914cd25f04874ac
source: Voice Control
es: Control por Voz

# s6debdeb5c7290e2b
source: PAUSED
es: PAUSA

# s9f949262986e25b4
source: RESUME GAME
es: REANUDAR JUEGO

# seb700a67f42cebd6
source: RESTART QUEST
es: REINICIAR MISIÓN

# s9e56095f217b2e23
source: RETURN TO HUB
es: VOLVER AL HUB

# s8ce7e9dd2f642ef7
source: Error: No quest data for completion screen.
es: Error: No hay datos de la misión para la pantalla de finalización.

# sad3a2d2a8a492607
source: Beginner
es: Principiante

# sb39c29728a3aab64
source: Intermediate
es: Intermedio

# s21b06c38fc4164db
source: Advanced
es: Avanzado

# s5f45b0a663a21651
source: Expert
es: Experto

# see2d1cfa6b9e6f6f
source: TALK
es: HABLAR

# sedfadfe170be83a2
source: Key architectural changes:
es: Cambios arquitectónicos clave:

# s1dc6a31104bfed9b
source: Identified Problem
es: Problema Identificado

# s47caac73da1099c8
source: Key Architectural Changes
es: Cambios Arquitectónicos Clave

# s87d3f0132330335f
source: Level Complete!
es: ¡Nivel Completado!

# s5aba8b77ba535ab1
source: Acquired! This item has been added to your inventory.
es: ¡Adquirido! Este objeto se ha añadido a tu inventario.

# s99767f199881ae10
source: PREV
es: ANTERIOR

# sc776f66d33e8b210
source: EVOLVE
es: EVOLUCIONAR

# sfa236dc6043a5fe8
source: NEXT
es: SIGUIENTE

# s57a94dec0f069ee2
source: You have obtained ${config.reward.name}.
es: Has obtenido ${this.config.reward.name}.

# s485889f52aa786db
source: Before Alarion can connect with others, he must learn to exist without being corrupted by them. In the Toxic Swamp of Global Scope, he must find an umbrella to protect his styles and DOM from the chaotic environment. Encapsulate your code.
es: Antes de que Alarión pueda conectarse con otros, debe aprender a existir sin ser corrompido por ellos. En el Pantano Tóxico del Ámbito Global, debe encontrar un paraguas para proteger sus estilos y el DOM del entorno caótico. Encapsula tu código.

# s51c87d409e952710
source: To understand the outside world, Alarion must learn to observe without interfering. The Orb of Inquiry reveals how to accept data through Attributes and Properties, reacting to changes like a reflection in water.
es: Para entender el mundo exterior, Alarión debe aprender a observar sin interferir. El Orbe de la Indagación revela cómo aceptar datos a través de Attributes y Properties, reaccionando a los cambios como un reflejo en el agua.

# s2c86e25fd47416e5
source: Deep within the Crystal Caverns lies the Heartstone, pulsing with energy. Alarion must learn to channel this energy (State) downstream to his children, ensuring the flow is unidirectional and controlled. Reactive Data Flow.
es: En lo profundo de las Cavernas de Cristal yace la Piedra Corazón, pulsando con energía. Alarión debe aprender a canalizar esta energía (State) hacia sus hijos, asegurando que el flujo sea unidireccional y controlado. Flujo de Datos Reactivo.

# sf8027c610f91f880
source: The Watchers demand proof of identity. Alarion must learn to speak for himself, dispatching Custom Events to notify the world of his actions, without checking who is listening. The principle of 'Fire and Forget'.
es: Los Vigilantes exigen prueba de identidad. Alarión debe aprender a hablar por sí mismo, despachando Custom Events para notificar al mundo de sus acciones, sin verificar quién está escuchando. El principio de 'Fire and Forget'.

# sea12f3198cad2a08
source: The Chaos Spirits try to break Alarion. He must forge a suit of Armor (Unit Tests) that can withstand every attack. Only by proving his logic is sound can he survive the Crimson Altar.
es: Los Espíritus del Caos intentan quebrar a Alarión. Debe forjar una armadura (Unit Tests) que pueda resistir cada ataque. Solo demostrando que su lógica es sólida podrá sobrevivir al Altar Carmesí.

# s15066548e3b50482
source: Alarion is blinded by the mists of the Unseen. He must learn to navigate using only his other senses (Accessibility/a11y), ensuring that even those who cannot see the path can still follow his journey.
es: Alarión es cegado por las nieblas de lo Invisible. Debe aprender a navegar usando solo sus otros sentidos (Accessibility/a11y), asegurando que incluso aquellos que no pueden ver el camino puedan seguir su viaje.

# sf6aa6654ed48e885
source: Focuses on removing global dependencies and encapsulating the code, achieving Shadow DOM and Custom Elements.
es: Se enfoca en eliminar dependencias globales y encapsular el código, logrando Shadow DOM y Custom Elements.

# sac91ff9e2dd01faa
source: Solution: The Evolved Code (Lit Web Component)
es: Solución: El Código Evolucionado (Lit Web Component)

# s5af1a84f40905b11
source: First Step Taken: Structure and Style are now safe, even if Logic is still coupled.
es: Primer Paso Dado: La Estructura y el Estilo ahora están seguros, aunque la Lógica aún esté acoplada.

# sc47115d5e0effb1c
source: Web Componet encapsulation
es: Encapsulación de Web Component

# s4c83f39bd1932e2b
source: Represents diverse Design Systems. Use Design Tokens (CSS Variables) to unify styles and enable Dark Mode.
es: Representa diversos Design Systems. Usa Design Tokens (CSS Variables) para unificar estilos y habilitar el Modo Oscuro.

# s160992d412654f3a
source: Alarion enters the Hall of Definition to learn how to forge abstract service contracts. Before injecting, we must define 'what' a service does, not 'how'. This creates a clear blueprint for any backend interaction.
es: Alarión entra al Salón de la Definición para aprender a forjar contratos de servicio abstractos. Antes de inyectar, debemos definir 'qué' hace un servicio, no 'cómo'. Esto crea un plano claro para cualquier interacción con el backend.

# sc860eda74c404af8
source: Component logic assumes direct interaction with fetch or a specific global object. No clear public interface for backend services. Lack of predictability and direct coupling to implementation details, not abstract needs.
es: La lógica del componente asume interacción directa con fetch o un objeto global específico. No hay una interfaz pública clara para los servicios de backend. Falta de predictibilidad y acoplamiento directo a detalles de implementación, no a necesidades abstractas.

# s5e83d9afbe2d6cce
source: Future-Proof: Any future backend service must implement this contract, ensuring compatibility.
es: A Prueba de Futuro: Cualquier servicio de backend futuro debe implementar este contrato, asegurando compatibilidad.

# sfa79530eb10e38d2
source: Inversion of Control: The parent provides the dependency, the child consumes it.
es: Inversion of Control: El padre proporciona la dependencia, el hijo la consume.

# sfc9ae1bd9be21023
source: Create the Provider
es: Crear el Provider

# s5b5ec4b51ea06c00
source: The Master Jeweler teaches Alarion to set the raw Crystal (Context) into the Necklace (Component). This represents the ContextConsumer: linking the component to data provided from above, transforming separate parts into a unified masterpiece.
es: El Maestro Joyero enseña a Alarión a engarzar el Cristal en bruto (Context) en el Collar (Component). Esto representa el ContextConsumer: vincular el componente a los datos proporcionados desde arriba, transformando partes separadas en una obra maestra unificada.

# s11f43aa9ed765241
source: The component creates its own service instance, ignoring the provider.
es: El componente crea su propia instancia de servicio, ignorando el provider.

# s1b736065170ad1d2
source: Dependency Injection: The component receives its dependency from the context.
es: Dependency Injection: El componente recibe su dependencia del contexto.

# s53fecc5b8475588d
source: Consume the context
es: Consumir el contexto

# s71a2e0f41a71be54
source: Testing with the real legacy service is slow, flaky, and requires a network connection.
es: Probar con el servicio legado real es lento, inestable y requiere una conexión de red.

# s70b481863f993d8f
source: Create the provider MOCK
es: Crear el provider MOCK

# s69553261c14fa075
source: Portability: We can swap the backend without touching the UI code.
es: Portabilidad: Podemos cambiar el backend sin tocar el código de UI.

# sc30ae3efd6e57d45
source: Agility: We can A/B test different implementations easily.
es: Agilidad: Podemos hacer A/B test de diferentes implementaciones fácilmente.

# sb0b4f9daad74e5a8
source: Future-Proofing: The application is ready for any future backend changes.
es: Preparación para el Futuro: La aplicación está lista para cualquier cambio futuro en el backend.

# sefcf950b3cc4fc3b
source: Language
es: Idioma

# s7fa4dd112e90286c
source: Initializing Game...
es: Inicializando Juego...

# sfc982e2a1b3ccece
source: Loading View...
es: Cargando Vista...

# sbd814146ebccf2b5
source: DRAG JOYSTICK TO MOVE
es: ARRRASTRA EL JOYSTICK PARA MOVERTE

# s7e3c3b04fd6fd6b9
source: TAP JOYSTICK TO INTERACT
es: TOCA EL JOYSTICK PARA INTERACTUAR

# s0fce4d264c5c04a9
source: Validation Valley
es: Valle de la Validación

# sa9689cfd15ad1be0
source: An RPG-style talk exploring the bottlenecks AI code generation has uncovered.
es: Una charla estilo RPG explorando los cuellos de botella que la generación de código con IA ha descubierto.

# s5656b52fc910b6e6
source: Built with Lit and Web Awesome.
es: Construido con Lit y Web Awesome.

# s5bdcbdb7ac4d8dc5
source: The Bottleneck Canyon
es: El Cañón de los Cuellos de Botella

# s626ab1202baedca5
source: A quest through two domains under pressure:
es: Una aventura a través de dos dominios bajo presión:

# s45119005de37d734
source: Open source security and the inner developer loop.
es: La seguridad del código abierto y el ciclo interno del desarrollador.

# s86b6f2611421e27d
source: The common denominator? Validation.
es: ¿El denominador común? La validación.

# sa2e44bb8968bc89e
source: Creators of mirrord — connect your local process to Kubernetes.
es: Creadores de mirrord — conecta tu proceso local a Kubernetes.

# sc1c1ad6a3aa624f4
source: Test against real environments without waiting for CI/CD.
es: Prueba contra entornos reales sin esperar CI/CD.

# se06da14784d98b99
source: Special Thanks
es: Agradecimientos Especiales

# s412c93fd8d37983d
source: This project is based on Legacy's End by Jorge del Casar.
es: Este proyecto está basado en Legacy's End de Jorge del Casar.

# s7972bac2bf003528
source: Thank you for creating such an inspiring foundation.
es: Gracias por crear una base tan inspiradora.

# s4e3c587c5f0ff09e
source: View Original Project
es: Ver Proyecto Original

# s18da858c09718664
source: About Validation Valley
es: Acerca de Valle de la Validación

# sd88c0f892fd4173f
source: The Bottleneck Shift
es: El Cambio del Cuello de Botella

# s0db94ba044aaf5dc
source: Validation in the Age of AI
es: Validación en la Era de la IA

# scf60ef48cf17ec62
source: AI has transformed how we generate code, documentation, and contributions. But generation was never the hard part. Journey through Validation Valley to understand why validation is now the constraint—and what we can do about it.
es: La IA ha transformado cómo generamos código, documentación y contribuciones. Pero generar nunca fue lo difícil. Viaja por el Valle de la Validación para entender por qué la validación es ahora la restricción—y qué podemos hacer al respecto.

# se1caf95f96026a94
source: Bottlenecks in the Age of AI-Generated Code
es: Cuellos de Botella en la Era del Código Generado por IA

# sfad40a528e96a064
source: AI code generation has shifted where software bottlenecks exist—but has not eliminated the need for validation. Journey through the canyon to discover three major bottlenecks and learn why validation is the bottleneck breaker.
es: La generación de código con IA ha cambiado dónde existen los cuellos de botella del software—pero no ha eliminado la necesidad de validación. Viaja por el cañón para descubrir tres cuellos de botella principales y aprender por qué la validación es lo que los rompe.

# s0bda23bf774504ea
source: LLMs on Kubernetes
es: LLMs en Kubernetes

# sd3b1385870e6fd13
source: Same Cluster, Different Threat Model
es: Mismo Clúster, Diferente Modelo de Amenazas

# sa185f107b3366fd3
source: LLMs take untrusted user input and decide what to do with it—a security problem Kubernetes doesn't solve. Explore the OWASP LLM Top 10, build an LLM gateway for policy enforcement, and validate it with mirrord.
es: Los LLMs toman entrada de usuario no confiable y deciden qué hacer con ella—un problema de seguridad que Kubernetes no resuelve. Explora el OWASP LLM Top 10, construye un gateway LLM para aplicar políticas y valídalo con mirrord.

# s1d673c41a864cef3
source: The Limits of Vibe Coding
es: Los Límites del Vibe Coding

# s364da28b42e7c103
source: What Happens When AI-Generated Code Lands in Your Cluster
es: Qué Pasa Cuando el Código Generado por IA Llega a Tu Clúster

# s2ef63da63bc1fffa
source: AI-generated code lands inside systems that already have keys to everything. Learn the specific risks—pod security, secret management, network exposure—and build open-source security skills for your AI coding assistant.
es: El código generado por IA aterriza en sistemas que ya tienen las llaves de todo. Aprende los riesgos específicos—seguridad de pods, gestión de secretos, exposición de red—y desarrolla habilidades de seguridad de código abierto para tu asistente de codificación con IA.

# sbd981315f8b6f297
source: You stand at the entrance to Validation Valley. The old ways of building software are changing. AI has arrived, and with it, a fundamental shift in where the hard work lies.
es: Estás en la entrada del Valle de la Validación. Las viejas formas de construir software están cambiando. La IA ha llegado, y con ella, un cambio fundamental en dónde reside el trabajo difícil.

# s94c728d253be0df1
source: The Shift Has Begun
es: El Cambio Ha Comenzado

# s68ccc0fba3e058d9
source: We're living through a fundamental shift in how software gets made.
es: Estamos viviendo un cambio fundamental en cómo se hace el software.

# sb5f31eaffcb9417c
source: AI tools have dramatically increased the speed at which code, documentation, and contributions can be generated.
es: Las herramientas de IA han aumentado dramáticamente la velocidad a la que se puede generar código, documentación y contribuciones.

# s200de3c144119ff2
source: But generation was never the hard part.
es: Pero generar nunca fue la parte difícil.

# sd847c2243e5541ba
source: The hard part is knowing whether what you generated is correct, secure, and actually works in reality.
es: Lo difícil es saber si lo que generaste es correcto, seguro y realmente funciona en la realidad.

# s9edacde93eac8a71
source: The Journey Ahead
es: El Viaje por Delante

# s63d5317b77364486
source: AI accelerates generation. Validation becomes the constraint.
es: La IA acelera la generación. La validación se convierte en la restricción.

# s15c51af715bbf263
source: This journey explores two domains where this shift creates pressure.
es: Este viaje explora dos dominios donde este cambio crea presión.

# se5cc138a97a4c430
source: And one principle that addresses both.
es: Y un principio que aborda ambos.

# sb10ba527745f9d17
source: The Witness
es: El Testigo

# s88469a98766542bc
source: Map of the Valley
es: Mapa del Valle

# s06f7dc8550905d1c
source: To the Maintainer's Hut
es: Hacia la Cabaña del Mantenedor

# sa184ea2666b6e6e3
source: The Curl Maintainer's Dilemma
es: El Dilema del Mantenedor de Curl

# s9b14a028a0f26d4c
source: In a small hut at the edge of the valley lives Daniel, keeper of curl. He has maintained this critical piece of infrastructure for over 25 years. But the nature of his burden has changed.
es: En una pequeña cabaña al borde del valle vive Daniel, guardián de curl. Ha mantenido esta pieza crítica de infraestructura durante más de 25 años. Pero la naturaleza de su carga ha cambiado.

# sd6522286b1179e8e
source: Low-Cost Submissions, High-Cost Review
es: Envíos de Bajo Costo, Revisión de Alto Costo

# s1819958864e6a3da
source: Daniel Stenberg has maintained curl for over 25 years. It's installed on billions of devices.
es: Daniel Stenberg ha mantenido curl durante más de 25 años. Está instalado en miles de millones de dispositivos.

# s64f2de838b401c7e
source: In recent years, he's faced a flood of AI-generated security reports.
es: En los últimos años, ha enfrentado una inundación de informes de seguridad generados por IA.

# s09b5ad9c9cbf177d
source: The cost to submit has dropped to nearly zero. The cost to review remains stubbornly human.
es: El costo de enviar ha caído a casi cero. El costo de revisar sigue siendo obstinadamente humano.

# s8514d8ce56254442
source: Many reports are low-quality, speculative, or outright wrong. But each one demands careful attention.
es: Muchos informes son de baja calidad, especulativos o simplemente incorrectos. Pero cada uno exige atención cuidadosa.

# s9a3d0f8f8aff2275
source: The asymmetry is stark: seconds to generate, hours to validate.
es: La asimetría es clara: segundos para generar, horas para validar.

# scce24de3e6e6aa90
source: The Maintainer's Burden
es: La Carga del Mantenedor

# s4b129f633a2639ea
source: curl is used by virtually every operating system, browser, and connected device.
es: curl es usado por prácticamente todos los sistemas operativos, navegadores y dispositivos conectados.

# s4d4340d35d7e461d
source: Stenberg has written extensively about the burden of triaging AI-generated reports.
es: Stenberg ha escrito extensamente sobre la carga de clasificar informes generados por IA.

# sb75c196ae83daeeb
source: The incentive structure rewards volume: bug bounty hunters can spray reports across projects.
es: La estructura de incentivos recompensa el volumen: los cazadores de bug bounty pueden esparcir informes por todos los proyectos.

# sa2e2b3b71098ab27
source: Even a low hit rate is profitable for submitters, but devastating for maintainers.
es: Incluso una tasa de éxito baja es rentable para los remitentes, pero devastadora para los mantenedores.

# s6e9f2cac5f33d4a5
source: Daniel's Echo
es: El Eco de Daniel

# s2442c65f707da3c4
source: Burden Stone
es: Piedra de la Carga

# s17e1cf375dba44fe
source: To the CVE Tower
es: Hacia la Torre CVE

# s082b7eb40d1fbca5
source: CVE Infrastructure Under Strain
es: Infraestructura CVE Bajo Presión

# s5b0a2c34cd827e7a
source: The tower looms ahead—the CVE Registry, keeper of vulnerability records. Once a trusted source of truth, it now struggles under the weight of noise.
es: La torre se eleva adelante—el Registro CVE, guardián de los registros de vulnerabilidades. Una vez fuente confiable de verdad, ahora lucha bajo el peso del ruido.

# sa1eb8d677221b8af
source: When Noise Overwhelms Signal
es: Cuando el Ruido Ahoga la Señal
