Repository: jakepage91/validation-valley
Catalog: xliff/*.xlf
Languages: es

# s0487f33d9ddaabde
source: About
es: Acerca de

# sa557ae6bee9148a6
source: Progress
es: Progreso

# s63bd678021e0a979
source: Coming Soon
es: Próximamente

# se3e714766f25ef93
source: Locked
es: Bloqueado

# s14bec4678c4e60cc
source: Restart
es: Reiniciar

# s81ecf2d4386b8e84
source: Continue
es: Continuar

# sae1c7f13b7c0c47f
source: Start
es: Empezar

# se68a71b4d65d0213
source: The Aura of Sovereignty
es: El Aura de Soberanía

# s4209b718183d43ac
source: Forging the Immutable Component Shield
es: Forjando el Escudo de Componentes Inmutables

# s4db3faa4e6a0d407
source: The Chromatic Loom
es: El Telar Cromático

# sd3390d82cc538516
source: Weaving the Threads of Agnosticism
es: Tejiendo los Hilos del Agnosticismo

# sb3f2a20bdd4defa9
source: Alarion visits the Weavers of the Chromatic Loom to learn the art of Agnosticism. He must create components that can accept any thread (color/theme) without being bound to a specific dye. Design Tokens are the key.
es: Alarión visita a las Tejedoras del Telar Cromático para aprender el arte del Agnosticismo. Debe crear componentes que puedan aceptar cualquier hilo (color/tema) sin estar atados a un tinte específico. Los Design Tokens son la clave.

# s27269f64a30adba7
source: The Orb of Inquiry
es: El Orbe de la Indagación

# sf08ce8cf4cf19dd8
source: Gazing into the Attribute Abyss
es: Mirando al Abismo de los Atributos

# s442c03e3d6b8af7d
source: The Flowing Heartstone
es: La Piedra Corazón Fluida

# s5b980d8d301f3d6f
source: Channeling the River of State
es: Canalizando el Río del Estado

# s8ea1bcd834cfb92a
source: The Watcher's Bastion
es: El Bastión del Vigilante

# sf05c67c570d53566
source: Guarding the Events of the Self
es: Protegiendo los Eventos del Yo

# s5b160847df044afb
source: The Mirror of Veracity
es: El Espejo de la Veracidad

# s29b486f26af4fd2a
source: Reflecting All Possible States
es: Reflejando Todos los Estados Posibles

# s3a98022fe720c05a
source: The Mirror shows Alarion not just who he is, but who he could be. He must build a Storybook of his life, documenting every possible state (Loading, Error, Empty, Success) to ensure he is ready for anything.
es: El Espejo le muestra a Alarión no solo quién es, sino quién podría ser. Debe construir un Storybook de su vida, documentando cada estado posible (Cargando, Error, Vacío, Éxito) para asegurar que está preparado para todo.

# sa6260f345b434dcd
source: The Crimson Altar
es: El Altar Carmesí

# sac27984bc517c1d0
source: Surviving the Unit Test Trials
es: Sobreviviendo a las Pruebas de Tests Unitarios

# saf50eb876522dd77
source: The Scroll of Tongues
es: El Pergamino de las Lenguas

# s12a1a58b97467796
source: Speaking to Every Soul
es: Hablando a Cada Alma

# sa46e3adb48120f25
source: The world is vast, and not everyone speaks the same language. Alarion must decrypt the Scroll of Tongues (i18n) to make his message understood by all, ensuring his legacy reaches every corner of the realm.
es: El mundo es vasto, y no todos hablan el mismo idioma. Alarión debe descifrar el Pergamino de las Lenguas (i18n) para que su mensaje sea entendido por todos, asegurando que su legado alcance cada rincón del reino.

# sf1ca98839c3d5aea
source: The Unseen Harmony
es: La Armonía Invisible

# s661341f8974b7c87
source: Navigating with the Mind's Eye
es: Navegando con el Ojo de la Mente

# s4916b3abaebeaeaa
source: The Oracle of Silicon
es: El Oráculo de Silicio

# s16e93b03015a1422
source: Optimizing the Essence of Time
es: Optimizando la Esencia del Tiempo

# s95ec118dc363f611
source: In the final trial, Alarion faces the Oracle, who judges him on speed and efficiency. He must optimize his performance, reduce his weight (bundle size), and move with the speed of thought. Performance & Best Practices.
es: En la prueba final, Alarión se enfrenta al Oráculo, quien le juzga por su velocidad y eficiencia. Debe optimizar su rendimiento, reducir su peso (tamaño del paquete) y moverse con la velocidad del pensamiento. Rendimiento y Mejores Prácticas.

# sc46a7ef0cfe1d954
source: The Swamp of Global Scope
es: El Pantano del Ámbito Global

# s52f4f3b58f3a9df9
source: Alarion's components break under Global CSS pollution. The Rainwalker shows him the Shadow Boundary—a protective barrier that shields his code from the outside world.
es: Los componentes de Alarión se rompen bajo la contaminación del CSS Global. El Caminante de la Lluvia le muestra el Límite de la Sombra: una barrera protectora que blinda su código del mundo exterior.

# s2f4b83266f726f1f
source: Before: Style Bleeding
es: Antes: Filtración de Estilos

# sa941ff90db8343c5
source: Global styles destroy component appearance.
es: Los estilos globales destruyen la apariencia del componente.

# scd3b7cbd78cfd3cf
source: After: Shadow Encapsulation
es: Después: Encapsulación Shadow

# s6713d5c57835a5a0
source: The Rainwalker
es: El Caminante de la Lluvia

# s66724ea8cd3f8825
source: Umbrella
es: Paraguas

# sb38339b1c61dbd0a
source: Hall of Fragments
es: Salón de los Fragmentos

# s1f9ae0b233f74e6b
source: The Acid Rain: Global styles that bleed everywhere
es: La Lluvia Ácida: Estilos globales que se filtran por todas partes

# s54fc4065dc89b12f
source: UMBRELLA (Encapsulated Styles)
es: PARAGUAS (Estilos Encapsulados)

# s0e10f182dd377d93
source: Problem: The code is tangled.
es: Problema: El código está enredado.

# sbf2819167477a496
source: It handles business logic (fetch),
es: Maneja la lógica de negocio (fetch),

# s3a004fd0c8b291af
source: knows the global DOM structure (getElementById),
es: conoce la estructura global del DOM (getElementById),

# s2a72f8bdfe13b23c
source: and injects styles and structure (innerHTML).
es: e inyecta estilos y estructura (innerHTML).

# se24d44fa21cd72d4
source: Identity Gained: The code is now a defined entity <product-item>), not a chaotic script.
es: Identidad Ganada: El código es ahora una entidad definida <product-item>), no un script caótico.

# sb636445465158fbb
source: DOM Independent: The component no longer uses getElementById or interacts with the global DOM directly.
es: Independiente del DOM: El componente ya no usa getElementById ni interactúa directamente con el DOM global.

# scf1664756789fc4d
source: Encapsulation Achieved: The static styles ensure the component is protected from the Monolith's global CSS (Shadow DOM).
es: Encapsulación Lograda: Los estilos estáticos aseguran que el componente esté protegido del CSS global del Monolito (Shadow DOM).

# sf14329d67ef7499b
source: Couple Logic
es: Lógica Acoplada

# sac3d85bb9f47a763
source: The Shadow Threshold
es: El Umbral de la Sombra

# s7f24951663b728e7
source: Fragments' Oracle
es: Oráculo de los Fragmentos

# s0a58208a8624ad8a
source: Garments
es: Vestiduras

# sa63dfa6295ac99be
source: Component styles bleed into global scope, and global styles break components. Lack of isolation.
es: Los estilos de los componentes se filtran al ámbito global, y los estilos globales rompen los componentes. Falta de aislamiento.

# seec73c0d56abb026
source: 2-3 short levels
es: 2-3 niveles cortos

# sf11de73d36a96117
source: Isolation
es: Aislamiento

# sbb41080a87a54195
source: Isolated Component
es: Componente Aislado

# s7d9d6c6c0d1548a9
source: Component isolated, no CSS/JS global conflicts
es: Componente aislado, sin conflictos globales de CSS/JS

# sa0baa3cd4b962212
source: Encapsulation and Isolation
es: Encapsulación y Aislamiento

# s631390b9da137600
source: Hall of Definition
es: Salón de la Definición

# s65659c8412e5b6cf
source: Before: The Concrete Dependency
es: Antes: La Dependencia Concreta

# s4bbbf8a15c544ecd
source: After: The Interface Contract
es: Después: El Contrato de Interfaz

# s483b84b17a7dec56
source: Contract First: We define an abstract interface (what the service does).
es: El Contrato Primero: Definimos una interfaz abstracta (lo que el servicio hace).

# sd6793f27b24e17d8
source: Clarity Gained: The component now expects a service that adheres to this clear contract.
es: Claridad Ganada: El componente ahora espera un servicio que cumpla con este contrato claro.

# scea26801c6830f8d
source: Preparation for IoC: This blueprint is the foundation for injecting any compliant service.
es: Preparación para IoC: Este plano es la base para inyectar cualquier servicio compatible.

# s63faa22e4efe2168
source: Interface Abstraction
es: Abstracción de Interfaz

# s2b7824e120cd2b78
source: Temple of Inversion
es: Templo de la Inversión

# s7a24d81d25cd47f4
source: Architect
es: Arquitecto

# sefba5ef46cf8e2e4
source: Codex
es: Códice

# see55cab941f2adb0
source: The Purveyor installs the Red Focus Crystal (Legacy Service) into the Altar. This demonstrates Context Provision: establishing a data source that flows downwards, available to any component that requests it.
es: El Proveedor instala el Cristal de Enfoque Rojo (Servicio Legado) en el Altar. Esto demuestra la Provisión de Contexto: establecer una fuente de datos que fluye hacia abajo, disponible para cualquier componente que la solicite.

# s6ec2eded774a2e52
source: Before: Component Coupling
es: Antes: Acoplamiento de Componentes

# s7142e9859e0eff97
source: The service is tightly coupled to the component, making it impossible to share the instance or swap the implementation.
es: El servicio está estrechamente acoplado al componente, lo que hace imposible compartir la instancia o cambiar la implementación.

# se4107f8416d2bd81
source: Context Provider
es: Proveedor de Contexto

# s8c074433cfc70429
source: Decoupling: Intermediate components don't need to know about the service.
es: Desacoplamiento: Los componentes intermedios no necesitan conocer el servicio.

# sf19bf0fd84b4b216
source: Flexibility: We can provide different implementations at different levels.
es: Flexibilidad: Podemos proporcionar diferentes implementaciones en diferentes niveles.

# s5c7f02e2b2a5b9b8
source: Tightly coupled
es: Estrechamente acoplado

# s5209fd340427dc51
source: Create the Context
es: Crear el Contexto

# s64e1a236d9b1943b
source: The Jeweler's Workshop
es: El Taller del Joyero

# sd226e8d2a040237d
source: Purveyor
es: Proveedor

# sf2e6f3bb262537e9
source: Crystal
es: Cristal

# s8a65ee1bba2b995d
source: Before: Hardcoded Dependency
es: Antes: Dependencia Codificada

# sb39fcb483e086bc1
source: After: Context Consumption
es: Después: Consumo de Contexto

# s7b796c663af71a3f
source: Decoupling: The component doesn't know who provides the service, only that it is provided.
es: Desacoplamiento: El componente no sabe quién proporciona el servicio, solo que se proporciona.

# sd8f9d232ac7bec9c
source: Logic is coupled to the component
es: La lógica está acoplada al componente

# s307420c84a41c5aa
source: Training Room
es: Sala de Entrenamiento

# s094ccfc1f93310b6
source: The Master Jeweler
es: El Maestro Joyero

# sa6413359281dd479
source: Necklace
es: Collar

# sdb261a4db7154269
source: The Assay Chamber
es: La Cámara de Ensayo

# s5f8893550401d47f
source: The Grand Appraiser uses a Lantern of Emulation (Mock Provider) to test the necklace without risking the real gem. This teaches the value of Mocking: validating the component in a controlled, isolated environment.
es: El Gran Tasador usa una Linterna de Emulación (Proveedor Mock) para probar el collar sin arriesgar la gema real. Esto enseña el valor del Mocking: validar el componente en un entorno controlado y aislado.

# s0ee7231379a2385e
source: Before: Hard Dependency
es: Antes: Dependencia Dura

# s35bb69540439ac8e
source: After: Mock Provider
es: Después: Proveedor Mock

# s345873e9c204e8d1
source: Isolation: We can test the component without external dependencies.
es: Aislamiento: Podemos probar el componente sin dependencias externas.

# s433f637f0c98b49e
source: Speed: Tests run instantly without network requests.
es: Velocidad: Las pruebas se ejecutan instantáneamente sin solicitudes de red.

# sa08a280f5486e341
source: Predictability: We control the data returned by the mock (The Yellow Light).
es: Predictibilidad: Controlamos los datos devueltos por el mock (La Luz Amarilla).

# s8b90160b219e3660
source: Testing with real service
es: Probando con el servicio real

# s226f8f2c9005d741
source: Liberated Battlefield
es: Campo de Batalla Liberado

# sa7bf063ad4011aec
source: Grand Appraiser
es: Gran Tasador

# sedd264c424d6a817
source: Amber Gem
es: Gema Ámbar

# s8a9cbbddd80739af
source: The final structure blocking the way forward. Interacting triggers the final sequence: the Hot Switch (swapping the Legacy Crystal for the New Blue Crystal) and the demonstration of 100% Portability.
es: La estructura final que bloquea el camino. Interactuar activa la secuencia final: el Cambio en Caliente (Hot Switch) (cambiando el Cristal Legado por el Nuevo Cristal Azul) y la demostración de la Portabilidad al 100%.

# saeb9dc9145403aa4
source: Before: Static Configuration
es: Antes: Configuración Estática

# seb3dd275987ee579
source: Changing the service implementation requires code changes and recompilation.
es: Cambiar la implementación del servicio requiere cambios en el código y recompilación.

# s9e91b8531cd17e69
source: After: Dynamic Injection
es: Después: Inyección Dinámica

# scf7303bd9af345c5
source: Legacy Context
es: Contexto Legado

# s7cda9b34add2b6aa
source: New Context
es: Contexto Nuevo

# s10ad6c66a65749b6
source: Other Context
es: Otro Contexto

# s78589f6aa7482f15
source: Victory
es: Victoria

# sedbed0d0ed06dd37
source: Oracle
es: Oráculo

# s506b6a19d12f414c
source: Key
es: Llave

# s7f3f5e5290e0f757
source: Tight coupling to concrete implementations, making testing and flexibility impossible.
es: Estrecho acoplamiento a implementaciones concretas, haciendo que las pruebas y la flexibilidad sean imposibles.

# s0dcb21efbc889a69
source: Backend Agnostic
es: Agnóstico del Backend

# sdeb611f8b2609422
source: 100% backend-agnostic and testable component
es: Componente 100% agnóstico del backend y testeable

# s50f2da4b996273aa
source: Logical Independence
es: Independencia Lógica

# sd03c537f123f42a6
source: Exit Fullscreen
es: Salir de Pantalla Completa

# s4b10acae683d2978
source: Fullscreen
es: Pantalla Completa

# se61fb5de09acfb7e
source: Choose your next adventure...
es: Elige tu próxima aventura...

# s90e63428cbbe41a3
source: Reset Progress
es: Reiniciar Progreso

# s2b588e75abe62d1a
source: Are you sure you want to reset all progress? This cannot be undone.
es: ¿Estás seguro de que quieres reiniciar todo el progreso? Esto no se puede deshacer.

# s94b45426c7ba0561
source: Loading Quest...
es: Cargando Misión...

# s091f3b38c997ae43
source: The Fortress of Design
es: La Fortaleza del Diseño

# s7b915d4313f0be69
source: Rigid Structure
es: Estructura Rígida

# s2b7b4f3f3ff3102a
source: Start by selecting the element to inspect its styles.
es: Comienza seleccionando el elemento para inspeccionar sus estilos.

# sab07b3e7339fe891
source: Hardcoded Colors
es: Colores Hardcodeados

# s58a28a6677db83d1
source: Style Guardian
es: Guardián de Estilo

# s4be8940d9940b09d
source: Trunk
es: Baúl

# sd1bc71506f968316
source: Hardcoded styles, inability to adapt to Dark Mode or different branding requirements.
es: Estilos hardcodeados, incapacidad de adaptarse al Modo Oscuro o a diferentes requisitos de marca.

# s07dedc6b8dd93f3b
source: Design Tokens
es: Tokens de Diseño

# s94bab3c06d9aa091
source: Programmatic Theming
es: Tematización Programática

# s472e08886f0af786
source: Visually Agnostic
es: Visualmente Agnóstico

# sd1d5b0a145b36520
source: Visually agnostic and adaptable component
es: Componente visualmente agnóstico y adaptable

# s7b4eac9640059f32
source: Visual Adaptation
es: Adaptación Visual

# s3920d50711b279a0
source: Prop drilling, unpredictable global state mutation, and excessive re-renders due to poor reactivity.
es: Prop drilling, mutación impredecible del estado global y re-renderizados excesivos debido a una reactividad deficiente.

# s15fad8f9b309db1d
source: Reactive Patterns
es: Patrones Reactivos

# sac335058bc37c05e
source: Observable Stores
es: Almacenes Observables

# se8fe905ea6d44e86
source: Context API (for Stores)
es: Context API (para Almacenes)

# s8d816573d0674c87
source: Unidirectional Data Flow
es: Flujo de Datos Unidireccional

# s246b8bc6be509180
source: State Master
es: Maestro del Estado

# s68992ea539645d1c
source: Reactive, predictable component without prop drilling
es: Componente reactivo y predecible sin prop drilling

# sfe0e3ab1cb2f3f07
source: State Predictability
es: Predecibilidad del Estado

# sb70fef79e7c5676c
source: Scattered authentication logic, repetitive `isLoggedIn()` checks, and vulnerable redirection flows.
es: Lógica de autenticación dispersa, comprobaciones `isLoggedIn()` repetitivas y flujos de redirección vulnerables.

# s7d875bb0db8cb33c
source: 4-5 levels
es: 4-5 niveles

# s114e78334455577f
source: Auth Guards
es: Guardias de Autenticación

# s5970d3bae8f9e5c1
source: User Context
es: Contexto de Usuario

# sc5d25a3b3ef6bb4f
source: Centralized Session Management
es: Gestión de Sesión Centralizada

# s13ec77bbc60946e0
source: Frontend Perimeter Security
es: Seguridad Perimetral del Frontend

# sc40b6086a271cdb9
source: Route Protection
es: Protección de Rutas

# sf73762748c563b5a
source: Security Sentinel Badge
es: Insignia de Centinela de Seguridad

# s1afbe2b2006aeab7
source: Application with protected routes, reactive and centrally managed user identity.
es: Aplicación con rutas protegidas, identidad de usuario reactiva y gestionada centralmente.

# s8193c9acacc2285f
source: Master of Centralized Security
es: Maestro de la Seguridad Centralizada

# sc0d727720d69c483
source: Code is fragile, prone to regression bugs, and lacks automated verification.
es: El código es frágil, propenso a errores de regresión y carece de verificación automatizada.

# s3f2eb0b23a6aaa1b
source: Testing Pyramid
es: Pirámide de Pruebas

# sd6edc75b2224287b
source: Unit Testing
es: Pruebas Unitarias

# sd242dcc1a9011655
source: Integration Testing
es: Pruebas de Integración

# s6c84ea19e1b38753
source: TDD
es: TDD (Desarrollo Guiado por Pruebas)

# sef880d4cc6b17e55
source: Truth Seeker
es: Buscador de la Verdad

# s910f34b9f9c7be14
source: A shielded component, verified and resistant to regressions
es: Un componente blindado, verificado y resistente a regresiones

# s585dea15de918480
source: Automated Verification
es: Verificación Automatizada

# se78c31b4691d2b9e
source: Unhandled errors crash the app, silent failures, lack of visibility into issues.
es: Los errores no manejados bloquean la app, fallos silenciosos, falta de visibilidad de los problemas.

# s985904951fd1671f
source: Centralized Error Handling
es: Manejo de Errores Centralizado

# s2992d526956f739e
source: Logging
es: Registro (Logging)

# s8095296216dfb9d1
source: Observability Patterns
es: Patrones de Observabilidad

# scfd198c2bade39d7
source: Boundary Error Components
es: Componentes Binarios de Error (Error Boundary)

# s5138b79ec85155dc
source: Chaos Warden
es: Guardián del Caos

# sddc983111270c750
source: Resilient application with full error observability
es: Aplicación resiliente con total observabilidad de errores

# s58be8fd77d82e55a
source: Centralized Monitoring
es: Monitoreo Centralizado

# s51ba2b11aefe9c55
source: Hardcoded strings, date/number format issues across regions, lack of localization.
es: Cadenas hardcodeadas, problemas de formato de fecha/número en distintas regiones, falta de localización.

# s8a60b9e2802b9efa
source: i18n Context
es: Contexto i18n

# sde66ec8ccc6219e6
source: Locale Management
es: Gestión de Locales

# sa365918edad2f689
source: Contextual Formatting
es: Formato Contextual

# s536a18dde6ef1a63
source: String Management
es: Gestión de Cadenas

# se562ae11843c776b
source: Polyglot Master
es: Maestro Políglota

# s3f434f25bd9e2874
source: Globally accessible component, adapted to any culture
es: Componente accesible globalmente, adaptado a cualquier cultura

# s57d529d392c103d4
source: Total Globalization
es: Globalización Total

# sa331782be5271ab6
source: The Fog of Silence
es: La Niebla del Silencio

# sa49e2738128db2b1
source: Alarion enters a thick fog where sight is useless. He must learn to navigate using inner resonance and digital echoes. Master the basics of Keyboard Navigation and ARIA Labels.
es: Alarión entra en una niebla espesa donde la vista es inútil. Debe aprender a navegar usando resonancia interna y ecos digitales. Domina los fundamentos de la Navegación por Teclado y las Etiquetas ARIA.

# s1ad88c0dacc21c9a
source: The Invisible Maze
es: El Laberinto Invisible

# s1d4354a32cb6dc45
source: The interface is a maze with no signs, invisible to those who cannot see with eyes.
es: La interfaz es un laberinto sin señales, invisible para aquellos que no pueden ver con los ojos.

# sc414ebee3df5c9d7
source: The Guided Path
es: El Camino Guiado

# s0bacbe48010c8159
source: By adding semantic labels and logical focus flow, the path becomes clear even in the darkest fog.
es: Al añadir etiquetas semánticas y un flujo de enfoque lógico, el camino se vuelve claro incluso en la niebla más oscura.

# s893b44f551f0e637
source: The Blind Guide
es: El Guía Ciego

# sb201036d942f39b6
source: Sonar Ring
es: Anillo de Sonar

# s660cb8552dffcdcb
source: The Echo Chamber
es: La Cámara de los Ecos

# sfb9576783fb61ff8
source: In the Echo Chamber, every change in the world must be announced to those listening. Learn to use ARIA Live Regions and Focus Management to harmonize the experience.
es: En la Cámara de los Ecos, cada cambio en el mundo debe ser anunciado a quienes escuchan. Aprende a usar las Regiones en Vivo ARIA y la Gestión del Enfoque para armonizar la experiencia.

# s3479687064f1159d
source: Silent Changes
es: Cambios Silenciosos

# s5ba0c472cf06d46c
source: Things happen in the shadow, but the Echoes remain silent, leaving the player lost.
es: Las cosas suceden en la sombra, pero los Ecos permanecen en silencio, dejando al jugador perdido.

# sb282629c765efb58
source: Resonant Truth
es: Verdad Resonante

# s50ceddeb85e4d961
source: With Live Regions, the world's pulse is heard by all, ensuring no event goes unnoticed.
es: Con las Regiones en Vivo, el pulso del mundo es escuchado por todos, asegurando que ningún evento pase desapercibido.

# s4775474db56a0b17
source: Vibrating Sigil
es: Sigilo Vibrante

# s0787c0dafbaed76b
source: Inaccessible application, keyboard traps, lack of screen reader support.
es: Aplicación inaccesible, trampas de teclado, falta de soporte para lectores de pantalla.

# sc8ec1b086cf70fba
source: Focus Management
es: Gestión del Enfoque

# s5c5739d6f76dc8ad
source: Screen Readers
es: Lectores de Pantalla

# s0129b7c570cbf1fe
source: Keyboard Navigation
es: Navegación por Teclado

# s4d0846efb5102f2b
source: Blindseer's Lens
es: Lente del Vidente Ciego

# s548ed6885aea474b
source: An accessible component, usable by all
es: Un componente accesible, utilizable por todos

# sd294ea002c3fc049
source: Universal Perception
es: Percepción Universal

# s4b53d959dcaf7c84
source: The Deaf Ear
es: El Oído Sordo

# s8adc502ed3406c0a
source: Fix a browser permission error blocking the microphone.
es: Corrige un error de permiso del navegador que bloquea el micrófono.

# sd92341cc73a5e8ad
source: The Muted Prophet
es: El Profeta Silenciado

# s32e2aa4fd0fb113e
source: The Oracle cannot hear your pleas because the gates of the browser are locked tight. You must unlock the voice channel.
es: El Oráculo no puede oír tus súplicas porque las puertas del navegador están cerradas a cal y canto. Debes desbloquear el canal de voz.

# s27f72b895e8a1e76
source: Voice Channel Open
es: Canal de Voz Abierto
