Repository: jakepage91/validation-valley
Catalog: xliff/*.xlf
Languages: es

# sf13f8258b2aba0cb
source: The CVE system was designed for a world where vulnerability reports were scarce and carefully researched.
es: El sistema CVE fue diseñado para un mundo donde los informes de vulnerabilidades eran escasos e investigados cuidadosamente.

# sfb963359fe5a8c4d
source: Today, the system is flooded. AI-generated reports, incentive-driven submissions, and automated scanning tools have increased volume dramatically.
es: Hoy, el sistema está inundado. Informes generados por IA, envíos impulsados por incentivos y herramientas de escaneo automatizadas han aumentado el volumen dramáticamente.

# s0e2e5ebb5f44e94a
source: Maintainers face alert fatigue. Real vulnerabilities get buried in noise.
es: Los mantenedores enfrentan fatiga de alertas. Las vulnerabilidades reales quedan enterradas en el ruido.

# s64428f101c84b1d7
source: Security depends on trust. When the signal-to-noise ratio collapses, everyone loses.
es: La seguridad depende de la confianza. Cuando la relación señal-ruido colapsa, todos pierden.

# s1328b7a6424e9faa
source: The Trust Degradation
es: La Degradación de la Confianza

# s8cf43a4a4682e73d
source: CVE assignment often happens before thorough validation.
es: La asignación de CVE a menudo ocurre antes de una validación exhaustiva.

# s66f0523f5eb7249a
source: Some projects spend more time disputing invalid CVEs than fixing real issues.
es: Algunos proyectos pasan más tiempo disputando CVEs inválidos que arreglando problemas reales.

# s9314ffbde8317efa
source: The degradation is self-reinforcing: as trust drops, serious researchers invest less effort.
es: La degradación se autorefuerza: a medida que cae la confianza, los investigadores serios invierten menos esfuerzo.

# sfc739387b499063b
source: This leaves the field to volume players.
es: Esto deja el campo a los jugadores de volumen.

# se271332bb4e765ab
source: The Registry Keeper
es: El Guardián del Registro

# s194bec61b0216799
source: Trust Shard
es: Fragmento de Confianza

# s2090507a1f4e2ab2
source: To the Dev Loop Mines
es: Hacia las Minas del Ciclo de Desarrollo

# s7d1e6546dc8cf92d
source: The Inner Loop Problem
es: El Problema del Ciclo Interno

# s4516fba574fc59b8
source: Deep in the mines, developers labor. AI has given them powerful tools to write code faster. But something hasn't changed—the waiting.
es: En lo profundo de las minas, los desarrolladores trabajan. La IA les ha dado herramientas poderosas para escribir código más rápido. Pero algo no ha cambiado—la espera.

# s4c1c60eaeef8b6a5
source: AI Helps You Write Faster. Not Wait Faster.
es: La IA Te Ayuda a Escribir Más Rápido. No a Esperar Más Rápido.

# s2868ec5e27da3152
source: Inside companies, AI coding assistants have accelerated how quickly developers write and modify code.
es: Dentro de las empresas, los asistentes de codificación con IA han acelerado la velocidad a la que los desarrolladores escriben y modifican código.

# sf3868a434f98ed4e
source: But the inner development loop still has the same bottleneck:
es: Pero el ciclo interno de desarrollo sigue teniendo el mismo cuello de botella:

# s986ecf442e9f81ba
source: Waiting for CI/CD to validate changes against real environments.
es: Esperar a que CI/CD valide los cambios contra entornos reales.

# sfc5fb7b5b3914bea
source: Write code in seconds, wait minutes or hours to discover if it actually works.
es: Escribir código en segundos, esperar minutos u horas para descubrir si realmente funciona.

# s9c108dddf4ff0e92
source: The validation delay hasn't shrunk. If anything, faster generation makes the wait feel longer.
es: El retraso de validación no se ha reducido. De hecho, la generación más rápida hace que la espera se sienta más larga.

# s4867cd1a8a40878b
source: The Waiting Game
es: El Juego de la Espera

# sc6a0d8e3511af854
source: Developers context-switch an average of 3-4 times while waiting for CI.
es: Los desarrolladores cambian de contexto un promedio de 3-4 veces mientras esperan el CI.

# sdd2931ccb458f492
source: Each context switch has cognitive costs that accumulate throughout the day.
es: Cada cambio de contexto tiene costos cognitivos que se acumulan a lo largo del día.

# s3044555072c61d67
source: The longer the feedback loop, the more disconnected the developer becomes.
es: Cuanto más largo el ciclo de retroalimentación, más desconectado se vuelve el desarrollador.

# s532e89e80278bd8e
source: CI should confirm, not discover.
es: El CI debería confirmar, no descubrir.

# sfaf1b2c3838e8c79
source: The Waiting Developer
es: El Desarrollador que Espera

# s91d2933046b0eb27
source: Hourglass Fragment
es: Fragmento del Reloj de Arena

# sf12fc82a79885231
source: To Pattern Peak
es: Hacia la Cima del Patrón

# s941800c7010205c6
source: The Pattern
es: El Patrón

# s04a9792557b8c5a3
source: You've climbed to Pattern Peak. From here, you can see the entire valley. The connection becomes clear.
es: Has subido a la Cima del Patrón. Desde aquí, puedes ver todo el valle. La conexión se vuelve clara.

# s1229afb7d1e19acb
source: The Shared Pattern
es: El Patrón Compartido

# s9e48de911de1ee79
source: Open source security and inner development loops seem like different problems.
es: La seguridad del código abierto y los ciclos internos de desarrollo parecen problemas diferentes.

# sfb096f51b8aef1ce
source: They're not.
es: No lo son.

# s109a376e360a5b53
source: Both are experiencing the same asymmetry:
es: Ambos están experimentando la misma asimetría:

# sa4f44b234d667a48
source: The cost to generate has dropped dramatically.
es: El costo de generar ha caído drásticamente.

# s69e034d69541054e
source: The cost to validate has remained high or even increased.
es: El costo de validar ha permanecido alto o incluso ha aumentado.

# s384e6630e0d60c90
source: AI amplifies this asymmetry. It makes generation nearly free without addressing validation at all.
es: La IA amplifica esta asimetría. Hace la generación casi gratuita sin abordar la validación en absoluto.

# s2a7758dffec44698
source: The Insight
es: La Revelación

# s1835a642997f5073
source: In both domains, generation got cheap. Validation stayed expensive.
es: En ambos dominios, generar se volvió barato. Validar siguió siendo caro.

# sa3434ef2cd7f338c
source: The solution isn't to slow down generation.
es: La solución no es frenar la generación.

# s11d0699d8841c0dc
source: It's to make validation faster, earlier, and cheaper.
es: Es hacer la validación más rápida, más temprana y más barata.

# sefbf3bfabf55d555
source: The Pattern Seer
es: El Vidente del Patrón

# sa168ea1b9993972f
source: Pattern Crystal
es: Cristal del Patrón

# s3c051e6c46e357a5
source: To Validation Springs
es: Hacia los Manantiales de Validación

# s4064e6c05264ed22
source: Better Validation
es: Mejor Validación

# sa90463ef369a872b
source: The springs of validation flow here. Not more validation—better validation. The water teaches you three principles.
es: Los manantiales de validación fluyen aquí. No más validación—mejor validación. El agua te enseña tres principios.

# s78df5bb53bbb3710
source: The Lever
es: La Palanca

# s5c56c43f291a9522
source: The lever is validation itself. Not 'more validation'—better validation.
es: La palanca es la validación misma. No 'más validación'—mejor validación.

# s62ebea4fc64cc733
source: Earlier:
es: Más temprano:

# sc94b264199231724
source: Catch issues before they compound, before they reach maintainers, before they hit production.
es: Detectar problemas antes de que se acumulen, antes de que lleguen a los mantenedores, antes de que lleguen a producción.

# s4409e1b0e508836e
source: Closer to reality:
es: Más cerca de la realidad:

# s15f2aaca17658f9c
source: Test against real dependencies, real services, real data shapes—not mocks that drift from truth.
es: Probar contra dependencias reales, servicios reales, formas de datos reales—no mocks que se alejan de la verdad.

# sb0795b32af1eb69e
source: Cheaper to fail:
es: Más barato fallar:

# sb27648afd145b9a5
source: Make it safe and fast to discover problems during development, not in production.
es: Hacer que sea seguro y rápido descubrir problemas durante el desarrollo, no en producción.

# sbca56ae0eb406c91
source: The Three Principles
es: Los Tres Principios

# s6d8f512b25c7234a
source: Earlier: Catch issues before they compound.
es: Más temprano: Detectar problemas antes de que se acumulen.

# s2fc6530fd5578760
source: Closer to reality: Test against real dependencies, not mocks.
es: Más cerca de la realidad: Probar contra dependencias reales, no mocks.

# s623e9f4062b3f1f3
source: Cheaper to fail: Discovery should happen during development.
es: Más barato fallar: El descubrimiento debería ocurrir durante el desarrollo.

# se167533b2b860220
source: The Spring Guardian
es: El Guardián del Manantial

# sb4ade09f694eef43
source: Validation Orb
es: Orbe de Validación

# s9a46c99de6355c94
source: To the Workshop
es: Hacia el Taller

# s10901eccf51c0751
source: An Example Workflow
es: Un Flujo de Trabajo de Ejemplo

# s171234f080279e79
source: In the workshop, you see one approach to earlier validation in action. Not the only way—but one example of the principle.
es: En el taller, ves un enfoque de validación más temprana en acción. No es la única manera—pero es un ejemplo del principio.

# s2081dec36cbb250a
source: mirrord: Connect Local to Real
es: mirrord: Conecta lo Local con lo Real

# s9540547207607204
source: One approach to earlier validation: run your code locally while connected to real remote dependencies.
es: Un enfoque para validación más temprana: ejecutar tu código localmente mientras estás conectado a dependencias remotas reales.

# sd23ad7baada60df3
source: mirrord lets developers plug their local process into a Kubernetes cluster—accessing real databases, services, and configurations without deploying.
es: mirrord permite a los desarrolladores conectar su proceso local a un clúster de Kubernetes—accediendo a bases de datos reales, servicios y configuraciones sin desplegar.

# s787172ad373e4b6c
source: The feedback loop shrinks from minutes to seconds.
es: El ciclo de retroalimentación se reduce de minutos a segundos.

# sba4f88de4c74a69b
source: Changes are validated against reality before they ever reach CI.
es: Los cambios se validan contra la realidad antes de que lleguen al CI.

# s5eb3cce9213c61a2
source: This isn't the only approach, and it's not a silver bullet. It's one example of the principle in action.
es: Este no es el único enfoque, y no es una bala de plata. Es un ejemplo del principio en acción.

# s1fa817181205618f
source: The Principle in Action
es: El Principio en Acción

# s23a4af4dffaa94a3
source: mirrord mirrors or steals traffic from a target pod.
es: mirrord refleja o roba tráfico de un pod objetivo.

# s0bd42d5d0d16989b
source: The local process accesses the cluster's network and filesystem.
es: El proceso local accede a la red y sistema de archivos del clúster.

# sefc1f63335676c46
source: Other tools exist: Telepresence, Bridge to Kubernetes, service meshes.
es: Existen otras herramientas: Telepresence, Bridge to Kubernetes, service meshes.

# sd34328e51663bbf7
source: The principle matters more than the specific tool.
es: El principio importa más que la herramienta específica.

# sac7ac8a3233d83ed
source: The Workshop Master
es: El Maestro del Taller

# se5fb5255df5c78fa
source: Mirror Shard
es: Fragmento de Espejo

# sd975f410278f08e7
source: To the Path Forward
es: Hacia el Camino Adelante

# sdf97112404ebfce6
source: The Path Forward
es: El Camino Adelante

# s20d3bc43e8edc8d6
source: You've reached the end of the valley. The path continues, but now you understand where it leads.
es: Has llegado al final del valle. El camino continúa, pero ahora entiendes hacia dónde lleva.

# s9255ae28bafa171a
source: The Bottleneck Has Shifted
es: El Cuello de Botella Ha Cambiado

# s57b3b96b2a465f4c
source: AI has permanently changed the economics of generation.
es: La IA ha cambiado permanentemente la economía de la generación.

# sa91c9e56aaf2fb8b
source: We can't go back to a world where production is the bottleneck.
es: No podemos volver a un mundo donde la producción es el cuello de botella.

# s615a150e4aa935ca
source: The question now is whether we adapt our validation practices to match—
es: La pregunta ahora es si adaptamos nuestras prácticas de validación para estar a la altura—

# s5ee3a8f833f420a4
source: —or continue drowning in unvalidated output.
es: —o seguimos ahogándonos en salida no validada.

# sb0ef72d43ebf5606
source: The Way Forward
es: El Camino a Seguir

# s99ca7a7b455e4fa1
source: For open source maintainers: better tooling for triage and automated pre-validation.
es: Para mantenedores de código abierto: mejores herramientas para clasificación y pre-validación automatizada.

# se1c846d325e525ea
source: For development teams: move validation earlier into the development process.
es: Para equipos de desarrollo: mover la validación más temprano en el proceso de desarrollo.

# sa99f5c82f43dd35c
source: The principle is simple.
es: El principio es simple.

# s21dce35879eab013
source: The implementation is where the work begins.
es: La implementación es donde comienza el trabajo.

# s8dc62abd16b5a22f
source: Our tools should shift with the bottleneck.
es: Nuestras herramientas deberían cambiar con el cuello de botella.

# s04bf6456176a1034
source: The Guide
es: El Guía

# s17d86e282386b088
source: Compass of Change
es: Brújula del Cambio

# seef785ef128a28a4
source: Quest Complete
es: Misión Completada

# s6b7387196826a440
source: AI accelerates generation but doesn't address validation. The bottleneck has shifted.
es: La IA acelera la generación pero no aborda la validación. El cuello de botella ha cambiado.

# s5df8d1cedf10c773
source: 8 chapters
es: 8 capítulos

# sd61653ebe961b17a
source: Validation
es: Validación

# s6ceef777939c74df
source: AI Generation
es: Generación con IA

# s347c758828ebbb0f
source: Developer Experience
es: Experiencia del Desarrollador

# sa2f9145fb7aaea14
source: Open Source Security
es: Seguridad del Código Abierto

# s21240ef7a5bcea84
source: Validation Master
es: Maestro de Validación

# sf75ededf5cfbea3d
source: Understood the shift from generation to validation
es: Entendió el cambio de generación a validación

# sc3b8fd99fd7aff5d
source: Earlier, Closer to Reality, Cheaper to Fail
es: Más Temprano, Más Cerca de la Realidad, Más Barato Fallar

# s4340fa071830c70e
source: The AI-Forged Lands
es: Las Tierras Forjadas por IA

# s1834b6be86e05e0d
source: You enter a landscape shaped by AI-generated code. Everything looks fast, abundant, but unstable. A guide awaits with a warning.
es: Entras en un paisaje formado por código generado por IA. Todo parece rápido, abundante, pero inestable. Un guía te espera con una advertencia.

# sfca45680994df6b6
source: Speed Has Consequences
es: La Velocidad Tiene Consecuencias

# s952dcb7f83712957
source: We're increasingly using tools with AI features.
es: Cada vez usamos más herramientas con funciones de IA.

# s7412d54cfb4a6099
source: In some areas, those tools help a lot.
es: En algunas áreas, esas herramientas ayudan mucho.

# scdcc40bb80f9d938
source: In other areas, AI doesn't help at all—and in some cases, it actually makes things worse.
es: En otras áreas, la IA no ayuda en absoluto—y en algunos casos, en realidad empeora las cosas.

# s711d2f1931bd22b1
source: Two Domains Under Pressure
es: Dos Dominios Bajo Presión

# sdbc0b560170e22f3
source: Maintainer burnout and CVE system strain
es: Agotamiento de mantenedores y tensión del sistema CVE

# s631b3c028387d4e7
source: The Inner Dev Loop
es: El Ciclo Interno de Desarrollo

# s9b6d321e0e0841e4
source: AI doesn't eliminate CI/CD waiting
es: La IA no elimina la espera de CI/CD

# sf9bf49a8fd68fd80
source: The Common Denominator: Validation
es: El Denominador Común: Validación

# sf3beb109126ce624
source: Both domains suffer from the same bottleneck. AI accelerates generation, but validation remains stubbornly human and time-consuming.
es: Ambos dominios sufren del mismo cuello de botella. La IA acelera la generación, pero la validación sigue siendo obstinadamente humana y consume tiempo.

# s2a70f91b33adffca
source: Better validation is the bottleneck breaker.
es: Una mejor validación es la que rompe el cuello de botella.

# saeaac589ba2764b6
source: You receive the Fractured Compass—a symbol of the broken pathways ahead.
es: Recibes la Brújula Fracturada—un símbolo de los caminos rotos que hay por delante.

# s2eef984a24e3dceb
source: Each fragment points to a different area where validation has cracked under AI pressure.
es: Cada fragmento señala un área diferente donde la validación se ha agrietado bajo la presión de la IA.

# s83bd01f6005167db
source: Follow the compass to understand each fracture before finding the solution.
es: Sigue la brújula para entender cada fractura antes de encontrar la solución.

# s746018821214edf5
source: Fractured Compass
es: Brújula Fracturada

# s25958f47ac909e59
source: To the Flooded Gate
es: Hacia la Puerta Inundada

# s40d049d2088384cb
source: The Flooded OSS Maintainer Gate
es: La Puerta Inundada del Mantenedor OSS

# s9cbbaf57ca2bef6a
source: The Flood of Reports
es: La Inundación de Informes

# s3756e1573ced6b26
source: Open source projects are overwhelmed by vulnerability reports.
es: Los proyectos de código abierto están abrumados por informes de vulnerabilidades.

# s3b814da692f47d20
source: Many are AI-generated, low-quality, or outright incorrect.
es: Muchos son generados por IA, de baja calidad o simplemente incorrectos.

# s3be7ffb075426bd9
source: The incentive structure rewards volume over accuracy.
es: La estructura de incentivos recompensa el volumen sobre la precisión.

# saf5c105a44a2b50f
source: If 1 report in 106 is accepted, that's still money in the bank.
es: Si 1 informe de 106 es aceptado, sigue siendo dinero en el banco.

# s3a4ccbc719b8c923
source: has maintained Curl for over 25 years.
es: ha mantenido Curl durante más de 25 años.

# sa377738c3b4336cd
source: He describes the strain this creates:
es: Él describe la tensión que esto crea:

# s995f264cc4f70a64
source: "The emotional toll of processing mind-numbing stupidities is overwhelming the team."
es: "El costo emocional de procesar estupideces agotadoras está abrumando al equipo."

# s3eec810e2a034a0d
source: A typical interaction Daniel has had to deal with:
es: Una interacción típica con la que Daniel ha tenido que lidiar:

# sd2c4324aa67aeb00
source: Curl has officially stopped paying for vulnerability reports.
es: Curl ha dejado oficialmente de pagar por informes de vulnerabilidades.

# s43816aad15b1f0e4
source: The pressure became unsustainable.
es: La presión se volvió insostenible.

# s39971a942a5928de
source: Two worrying surveys paint the same picture:
es: Dos encuestas preocupantes pintan el mismo cuadro:

# sf733c02c62a4bb4f
source: Intel Open Source Community Survey
es: Encuesta de la Comunidad de Código Abierto de Intel

# s5c372e52dc117cd8
source: identify maintainer burnout as top challenge
es: identifican el agotamiento de mantenedores como el principal desafío

# sdc9fe7c8e28aff42
source: 2024 Tidelift Maintainer Survey
es: Encuesta de Mantenedores de Tidelift 2024

# s762e287609c2d947
source: have quit (22%) or considered quitting (36%)
es: han renunciado (22%) o han considerado renunciar (36%)

# se41874cfb878342b
source: You receive the Burden Stone—a weight that cannot be set down.
es: Recibes la Piedra de la Carga—un peso que no se puede dejar.

# sab7f8f69dbcc693c
source: It represents the realization that maintainers are carrying an unsustainable load.
es: Representa la comprensión de que los mantenedores están llevando una carga insostenible.

# s7ff41452d201a676
source: They are on their last legs. Something must change.
es: Están en las últimas. Algo debe cambiar.

# s53a44d467f6d7421
source: Weary Maintainer
es: Mantenedor Agotado

# sb18df7f23e2ad6ae
source: To the Cracked Archive
es: Hacia el Archivo Agrietado

# s290169bb78dcc45f
source: The Cracked Vulnerability Archive
es: El Archivo de Vulnerabilidades Agrietado

# s539c2995476de0e6
source: The Foundation Everyone Depends On
es: La Base de la que Todos Dependemos

# s8cc67305400a0bd8
source: The CVE Program
es: El Programa CVE

# sba2881dc4e67e5fd
source: The MITRE Corporation — an American not-for-profit organization providing independent technical expertise for national challenges — was maintaining this database.
es: MITRE Corporation—una organización estadounidense sin fines de lucro que proporciona experiencia técnica independiente para desafíos nacionales—mantenía esta base de datos.

# sad0dc114c8bc93df
source: The contract lapsed in April 2025.
es: El contrato venció en abril de 2025.

# sd9efcfa2bee5bb21
source: CISA Steps In
es: CISA Interviene

# s914d231bdc7f5a8c
source: The Cybersecurity and Infrastructure Security Agency extended MITRE's CVE contract at the last minute by about 11 months, until March 2026.
es: La Agencia de Seguridad de Infraestructura y Ciberseguridad extendió el contrato CVE de MITRE en el último minuto por unos 11 meses, hasta marzo de 2026.

# s31b30d3c1c32e4b9
source: "While this avoided disruption, it exposed how fragile a piece of critical infrastructure can be."
es: "Aunque esto evitó la interrupción, expuso lo frágil que puede ser una pieza de infraestructura crítica."

# s825dec4634376550
source: From Growth Era to Quality Era
es: De la Era del Crecimiento a la Era de la Calidad

# sd34105af748fec87
source: In late 2025, CISA announced a shift for the CVE program: prioritizing better validation, completeness, and trust over raw volume.
es: A finales de 2025, CISA anunció un cambio para el programa CVE: priorizando mejor validación, completitud y confianza sobre el volumen bruto.

# s3e776ff7b63fe685
source: Improving data quality
es: Mejorando la calidad de los datos

# s2f6072db7dbee456
source: Strengthening CNA partnerships
es: Fortaleciendo las asociaciones CNA

# sf3856efbe8593b6e
source: Modernizing infrastructure
es: Modernizando la infraestructura

# sdd6978c8ccb953ed
source: The issue isn't that the CVE system is broken. It's that it was designed for careful human validation and is now operating under unprecedented scale and noise.
es: El problema no es que el sistema CVE esté roto. Es que fue diseñado para validación humana cuidadosa y ahora opera bajo una escala y ruido sin precedentes.

# s1668dfb44340aa35
source: If validation doesn't improve, trust in CVEs, scanners, and prioritization will continue to erode.
es: Si la validación no mejora, la confianza en los CVEs, escáneres y priorización continuará erosionándose.

# s6190d6b6529e1ec6
source: The vulnerability tracking system everyone relies on is becoming less trustworthy — exactly when we need it most.
es: El sistema de seguimiento de vulnerabilidades del que todos dependen se está volviendo menos confiable—exactamente cuando más lo necesitamos.

# sc796f4f845294b35
source: Security teams can't rely on assigned CVEs to prioritize their work.
es: Los equipos de seguridad no pueden confiar en los CVEs asignados para priorizar su trabajo.

# se7f7ab087ebef779
source: Developers don't trust vulnerability scanners anymore — false-positive rates are extremely high.
es: Los desarrolladores ya no confían en los escáneres de vulnerabilidades—las tasas de falsos positivos son extremadamente altas.

# s7a9c3c5ba457204f
source: The whole system is deteriorating.
es: Todo el sistema se está deteriorando.

# s832ce5535248ef57
source: What Can Be Done?
es: ¿Qué Se Puede Hacer?

# sa989c08166940cf0
source: AI Disclosure
es: Divulgación de IA

# sd8309b359e5cb7f9
source: Curl and Django already ask submitters whether AI was used in the submission.
es: Curl y Django ya preguntan a los remitentes si se usó IA en el envío.
