Repository: jakepage91/validation-valley
Catalog: xliff/*.xlf
Languages: es

# s90986880d5c2ace2
source: Rethinking Incentives
es: Repensando los Incentivos

# s41d187e9d0b377b2
source: Daniel and the curl team have already removed the financial aspect from their bug bounty program.
es: Daniel y el equipo de curl ya han eliminado el aspecto financiero de su programa de bug bounty.

# s9850036ee549e4ae
source: What Everyone Agrees On
es: En Lo Que Todos Están de Acuerdo

# s12e02bbcc559badc
source: Stricter submission requirements — including proven validation. Improved ways of validating are what's required.
es: Requisitos de envío más estrictos—incluyendo validación comprobada. Se requieren mejores formas de validar.

# sec74b4db301bb5a6
source: You receive the Trust Shard — a fragment of something that was once whole.
es: Recibes el Fragmento de Confianza—un fragmento de algo que una vez fue entero.

# s25eb0823fe5e9c84
source: It represents the eroding trust in the systems we all depend on.
es: Representa la erosión de la confianza en los sistemas de los que todos dependemos.

# s6c67f1fe40ca07f6
source: Without validation, trust crumbles. This shard is a reminder.
es: Sin validación, la confianza se desmorona. Este fragmento es un recordatorio.

# scac6cec5c093ede0
source: The Archive Keeper
es: El Guardián del Archivo

# s02434c7878dc46df
source: To the Endless Loop
es: Hacia el Bucle Sin Fin

# saf2cd213e922806a
source: The Endless Loop
es: El Bucle Sin Fin

# s8a67209edd2ebde3
source: Even AI Has to Wait
es: Incluso la IA Tiene que Esperar

# s40bc78d99470bca3
source: AI coding assistants have accelerated how quickly developers write and modify code.
es: Los asistentes de codificación con IA han acelerado la velocidad con la que los desarrolladores escriben y modifican código.

# s0a5ed1509805f478
source: But the inner dev loop still has the same bottleneck.
es: Pero el ciclo interno de desarrollo sigue teniendo el mismo cuello de botella.

# s50573b8f6e982fa4
source: Even AI has to wait for CI/CD to complete.
es: Incluso la IA tiene que esperar a que CI/CD termine.

# s61961e1d3e878bc2
source: Waiting for pipelines and deployment to run to completion in order to test your code in a realistic environment.
es: Esperando a que los pipelines y el despliegue terminen para poder probar tu código en un entorno realista.

# sad0699f4589b4a17
source: Developers wait several minutes for CI
es: Los desarrolladores esperan varios minutos por el CI

# s20020f1c552b8b71
source: Context-switching 3-4 times while waiting
es: Cambiando de contexto 3-4 veces mientras esperan

# s2d53c0556072f232
source: Each context switch has cognitive costs that accumulate
es: Cada cambio de contexto tiene costos cognitivos que se acumulan

# sa05960089f702e46
source: Ideally one iteration — reality is often multiple
es: Idealmente una iteración—la realidad a menudo son múltiples

# s765b1a2af20347bb
source: You receive the Hourglass Fragment — a shard of time reclaimed.
es: Recibes el Fragmento del Reloj de Arena—un trozo de tiempo recuperado.

# se34c1936325fb686
source: It represents the realization that waiting is legacy. Waiting is something we need to avoid.
es: Representa la comprensión de que esperar es legado. Esperar es algo que necesitamos evitar.

# s9d68853e9ee637f0
source: We're not getting rid of CI/CD pipelines. We're running them only once we've validated and know the code is ready.
es: No estamos eliminando los pipelines de CI/CD. Los ejecutamos solo una vez que hemos validado y sabemos que el código está listo.

# s00121229cd8eb496
source: To the Clearing
es: Hacia el Claro

# s8badc3e540ed544e
source: The Validation Clearing
es: El Claro de la Validación

# s3a7262075eda76aa
source: Mirror of Validation
es: Espejo de Validación

# s5c5f4c7bb741c75a
source: AI accelerates generation but doesn't address validation. The bottleneck has shifted—and validation is now the constraint.
es: La IA acelera la generación pero no aborda la validación. El cuello de botella ha cambiado—y la validación es ahora la restricción.

# s06adef3243dd1b50
source: CVE System
es: Sistema CVE

# s47e7b8e7c9fca09d
source: Inner Developer Loop
es: Ciclo Interno del Desarrollador

# sd02c219f4bd63f34
source: Validation Workflows
es: Flujos de Validación

# sc15e6f04b05b6830
source: Canyon Navigator
es: Navegador del Cañón

# s94bc61a925854be6
source: Understood how AI shifts bottlenecks and why validation is the answer
es: Entendió cómo la IA cambia los cuellos de botella y por qué la validación es la respuesta

# sc7b6304158d1e169
source: VALIDATION VALLEY
es: VALLE DE LA VALIDACIÓN

# sd59dcb330ccd8e3d
source: Where the Legacy Dev Loop Ends
es: Donde Termina el Ciclo de Desarrollo Legado

# s00dba26fbe2c0ac6
source: VALIDATION VALLEY is your journey through the bottlenecks of modern software development. Discover how AI has shifted where constraints exist—and learn why validation is the new frontier.
es: VALLE DE LA VALIDACIÓN es tu viaje a través de los cuellos de botella del desarrollo de software moderno. Descubre cómo la IA ha cambiado dónde existen las restricciones—y aprende por qué la validación es la nueva frontera.

# s05cb7625ceae4f5f
source: Your Journey Ahead
es: Tu Viaje por Delante

# s703678b74f11d1ef
source: Collect a reward after each stage representing what we've learned
es: Recoge una recompensa después de cada etapa representando lo que hemos aprendido

# se63e62cf9445478f
source: The Common Thread
es: El Hilo Común

# sdf1757350ffabbb4
source: It's to improve validation.
es: Es mejorar la validación.

# s9767d735e9a145c4
source: Faster
es: Más Rápida

# sac2aaf073ed664bb
source: Earlier
es: Más Temprana

# s950fa8cb207c3857
source: Cheaper
es: Más Económica

# sf4cc070a77e28953
source: For Developers
es: Para Desarrolladores

# sb8aab58b6ebf8c78
source: Validate code changes earlier, directly from your local machine.
es: Valida cambios de código más temprano, directamente desde tu máquina local.

# sa21ee8fdf376edc8
source: mirrord architecture diagram
es: diagrama de arquitectura de mirrord

# sb9a4a5e4fbdf33f8
source: Now It's Your Turn
es: Ahora Es Tu Turno

# s038f4fc8b6cd487d
source: The best way to understand is to experience it yourself.
es: La mejor manera de entender es experimentarlo tú mismo.

# s67e0c708ffa05d83
source: The MirrorD Sage
es: El Sabio MirrorD

# s4a70e8116cd4fd09
source: The End
es: El Final

# seef2228c02cc19e1
source: Your Journey Complete
es: Tu Viaje Completo

# s6bacdfd159ada10b
source: Along the way, you gathered these insights:
es: A lo largo del camino, reuniste estas ideas:

# s23bec4c7ec011f51
source: AI accelerates generation. Validation remains the key.
es: La IA acelera la generación. La validación sigue siendo la clave.

# s24714f1c331b8437
source: Magic mirror
es: Espejo mágico

# s3efa939fa828fe0f
source: 🪞 Try Demo
es: 🪞 Probar Demo

# sb15fca8be2479e75
source: Walk to the Vote app and try the demo.
es: Camina a la app Vote y prueba la demo.

# sba2da749037dccf5
source: Demo Mirror
es: Espejo Demo

# s7827dc15e74c9a02
source: 5 chapters
es: 5 capítulos

# sd4c2a2efcdaa52fa
source: Open source projects like Django and Curl have offered bug bounties — financial rewards for real vulnerability reports — through platforms like HackerOne.
es: Proyectos de código abierto como Django y Curl han ofrecido bug bounties — recompensas financieras por reportes reales de vulnerabilidades — a través de plataformas como HackerOne.

# s3b70f3baf46e26e6
source: volunteers
es: voluntarios

# se55a0d305decb4a9
source: per week each
es: por semana cada uno

# s2eb8b559156d752c
source: reports (July 2025)
es: reportes (julio 2025)

# s79a3a8baab512eb5
source: Each report requires multiple maintainers to investigate.
es: Cada reporte requiere que múltiples mantenedores investiguen.

# sd4bad83f4302a7ea
source: The math doesn't add up.
es: Las cuentas no cuadran.

# s0247959b56ea898c
source: Three people read the report. One tries to reproduce. Another examines source code. A third checks for similar vulnerabilities.
es: Tres personas leen el reporte. Una intenta reproducirlo. Otra examina el código fuente. Una tercera busca vulnerabilidades similares.

# s4baca38af671c6c9
source: After 1.5 hours of combined effort: the report is garbage. Hallucinated function names. Impossible attack vectors.
es: Después de 1.5 horas de esfuerzo combinado: el reporte es basura. Nombres de funciones alucinados. Vectores de ataque imposibles.

# s64e71c2bf3e3b821
source: You don't get those hours back. And tomorrow, two more arrive.
es: No recuperas esas horas. Y mañana, llegan dos más.

# s6640cf21ccbb6c94
source: Modern digital infrastructure depends on a critical vulnerability tracking system: the CVE Program.
es: La infraestructura digital moderna depende de un sistema crítico de seguimiento de vulnerabilidades: el Programa CVE.

# s1f164f217e5aab10
source: What's at Stake
es: Lo Que Está en Juego

# sedbbadb4f9097d60
source: Try mirrord yourself
es: Prueba mirrord tú mismo

# saf344402988993a7
source: If you find it useful, we'd appreciate a
es: Si te resulta útil, agradeceríamos una

# s1fc90377974d7a0f
source: on GitHub
es: en GitHub
